documents/quaternions/quaternion-algebras.tex
% Created 2025-06-08 Sun 11:07
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}

%%--------------------------------------------------------------------------------

\usepackage[svgnames]{xcolor}
\usepackage{mathrsfs}
\usepackage{tikz-cd}
\usepackage{svg}
\usepackage[top=25mm,bottom=25mm,left=25mm,right=30mm]{geometry}


\usepackage{amsthm}
\usepackage{thmtools}
\usepackage{cleveref}
\usepackage{stmaryrd}

%%\usepackage[outputdir=build]{minted}
\usepackage{minted}
\usemintedstyle{tango}
\usepackage[svgnames]{xcolor}
\setminted[bash]{bgcolor=NavajoWhite}
\setminted[python]{bgcolor=Lavender}
\setminted[sage]{bgcolor=Lavender}

\usepackage{titlesec}
%%\newcommand{\sectionbreak}{\clearpage}


\renewcommand{\descriptionlabel}[1]{\hspace{\labelsep}#1}


\usepackage[cal=boondox]{mathalfa}


\newenvironment{referee}{\color{red}}{\color{black}}

\numberwithin{equation}{section}

\declaretheorem[numberwithin=subsection,Refname={Theorem,Theorems}]{theorem}
\declaretheorem[sibling=theorem,name=Proposition,Refname={Proposition,Propositions}]{proposition}
\declaretheorem[sibling=theorem,name=Corollary,Refname={Corollary,Corollaries}]{corollary}
\declaretheorem[sibling=theorem,name=Lemma,Refname={Lemma,Lemmas}]{lemma}
\declaretheorem[sibling=theorem,name=Remark,style=remark,Refname={Remark,Remarks}]{remark}
\declaretheorem[sibling=theorem,name=Problem,style=remark,Refname={Problem,Problems}]{problem}
\declaretheorem[sibling=theorem,name=Example,style=remark,Refname={Example,Examples}]{ex}
\declaretheorem[sibling=theorem,name=Definition,style=remark,Refname={Definition,Definitions}]{definition}

\crefname{equation}{}{}

%%--------------------------------------------------------------------------------

\newenvironment{solution}
{\par \color{red}\hrulefill \newline \noindent \textbf{Solution:} \vspace{2mm}}
{\vspace{2mm} \color{black}}


\newcommand{\totdeg}{\operatorname{totdeg}}
\newcommand{\content}{\operatorname{content}}

\newcommand{\Mat}{\operatorname{Mat}}

\newcommand{\Aut}{\operatorname{Aut}}
\newcommand{\Gal}{\operatorname{Gal}}

\newcommand{\A}{\mathscr{A}}
\newcommand{\B}{\mathscr{B}}
\newcommand{\FF}{\mathscr{F}}
\newcommand{\LF}{\mathcal{LF}}

\newcommand{\HH}{\mathcal{H}}
\newcommand{\X}{\mathscr{X}}

\newcommand{\ff}{\mathfrak{f}}
\newcommand{\pp}{\mathfrak{p}}

\newcommand{\Z}{\mathbb{Z}}
\newcommand{\Nat}{\mathbb{N}}
\newcommand{\Q}{\mathbb{Q}}
\newcommand{\R}{\mathbb{R}}
\newcommand{\C}{\mathbb{C}}
\newcommand{\F}{\mathbb{F}}

\newcommand{\PP}{\mathbb{P}}

\newcommand{\Poly}{\mathcal{P}}
%%--------------------------------------------------------------------------------
\author{George McNinch}
\date{2025-06-08 11:07:06 EDT (george@valhalla)}
\title{Quaternion algebras}
\hypersetup{
 pdfauthor={George McNinch},
 pdftitle={Quaternion algebras},
 pdfkeywords={quaternions, number-theory},
 pdfsubject={},
 pdfcreator={Emacs 30.0.92 (Org mode 9.7.11)}, 
 pdflang={English}}
\usepackage{calc}
\newlength{\cslhangindent}
\setlength{\cslhangindent}{1.5em}
\newlength{\csllabelsep}
\setlength{\csllabelsep}{0.6em}
\newlength{\csllabelwidth}
\setlength{\csllabelwidth}{0.45em * 0}
\newenvironment{cslbibliography}[2] % 1st arg. is hanging-indent, 2nd entry spacing.
 {% By default, paragraphs are not indented.
  \setlength{\parindent}{0pt}
  % Hanging indent is turned on when first argument is 1.
  \ifodd #1
  \let\oldpar\par
  \def\par{\hangindent=\cslhangindent\oldpar}
  \fi
  % Set entry spacing based on the second argument.
  \setlength{\parskip}{\parskip +  #2\baselineskip}
 }%
 {}
\newcommand{\cslblock}[1]{#1\hfill\break}
\newcommand{\cslleftmargin}[1]{\parbox[t]{\csllabelsep + \csllabelwidth}{#1}}
\newcommand{\cslrightinline}[1]
  {\parbox[t]{\linewidth - \csllabelsep - \csllabelwidth}{#1}\break}
\newcommand{\cslindent}[1]{\hspace{\cslhangindent}#1}
\newcommand{\cslbibitem}[2]
  {\leavevmode\vadjust pre{\hypertarget{citeproc_bib_item_#1}{}}#2}
\makeatletter
\newcommand{\cslcitation}[2]
 {\protect\hyper@linkstart{cite}{citeproc_bib_item_#1}#2\hyper@linkend}
\makeatother\begin{document}

\maketitle
\section{Some references}
\label{sec:org71ff2e3}

\begin{itemize}
\item \href{https://kconrad.math.uconn.edu/blurbs/ringtheory/quaternionalg.pdf}{Some notes of Keith Conrad (UConn)}

\item first chapter of \href{https://www.cambridge.org/core/books/central-simple-algebras-and-galois-cohomology/B4A8F430A0D6C5A59722BD48AEF94C05}{Gille-Szamuely - ``Central Simple Algebras and Galois Cohomology''}
\end{itemize}
\section{Quaternion algebras, defined}
\label{sec:org50302f5}

If \(k\) is a field, an \emph{algebra} \(A\) over \(k\) is a \(k\)-vector
space \(A\) together with operations \(+:A \times A \to A\) and
\(\cdot:A \times A \to A\) which satisfy the axioms of a \emph{ring}.

Here, we are going to insist that the algebra \(A\) be finite
dimensional as a \(k\)-vector space, and that there is a
multiplicative identity element \(1 \in A\).

Given a field \(\ell\) containing \(k\) (a ``field extension of \(k\)'')
we can form an \(\ell\)-algebra \(A_\ell\) by \emph{extension of
scalars}. (Really, this is the tensor product: \(A_\ell = A \otimes_k
\ell\)).

The algebra \(A\) is said to be \emph{central simple} over \(k\) if for
some field extension \(\ell\) of \(k\) and for some \(n \in \Nat\), the
\(\ell\)-algebra \(A_\ell\) is isomorphic as \(\ell\)-algebras to
\(\Mat_n(\ell)\), the algebra of \(n \times n\) matrices
over \(\ell\).

Now, a \emph{quaternion algebra} is a central simple algebra \(Q\) over
\(k\) with \(\dim Q = 4\). Thus for some field extension \(\ell\) of
\(k\), the \(\ell\)-algebra \(Q_\ell\) is isomorphic to
\(\Mat_{2}(k)\)
\section{A description of quaternion algebras}
\label{sec:org59895fd}

A quaternion algebra \(Q\) over \(k\) can be described in a explicit
manner. The case where \(k\) has characteristic 2 is slightly
different and I'll omit it here, so suppose that \(k\) has
characteristic \(\ne 2\).

Given \(a,b \in k\) non-zero elements, we define the \(k\)-algebra
\((a,b)_k\) to be the \(k\)-vector space with basis \(1,i,j,ij\) where
the multiplication satisfies \[i^2 = a, j^2 = b, ij = -ji\]

\begin{theorem}
Suppose that \(k\) does not have characteristic 2.  If \(Q\) is a
quaternion algebra over \(k\), there are non-zero elements \(a,b \in
k\) for which \(Q \simeq (a,b)_k\).
\label{theorem:quaternion-described}
\end{theorem}

If \(\alpha = s + ti + uj + vij \in (a,b)_k\) for \(s,t,u,v \in k\),
the conjugate \(\overline{\alpha}\) is defined to be
\begin{equation*}
\overline{\alpha} = s - ti - uj - vij
\end{equation*}

\begin{proposition}
The assignment \(N:(a,b)_k \to k\) given by \(N(\alpha) = \alpha \cdot
\overline{\alpha} = s^2 - at^2 - bu^2 + abv\) defines a non-degenerate
quadratic form on the vector space \((a,b)_k\).
\label{proposition:norm}
\end{proposition}
We call this quadratic form \(N\) the \emph{norm} -- or the \emph{norm form} --
of the quaternion algebra \((a,b)_k\).

\begin{theorem}
The quaternion algebra \((a,b)_k\) is a division algebra if and only
if the norm \(N\) does not vanish at any nonzero element of \((a,b)_k\);
i.e. \(N(\alpha) = 0 \implies \alpha = 0\).
\label{theorem:division-algebra-condition}
\end{theorem}
\section{Associated conics}
\label{sec:org5e0f879}

Associated with the quaternion algebra \((a,b)_k\) is the conic
\(C=C(a,b)\) which is the set of solutions to the equation \(ax^2 +
by^2 = z^2\) in the projective plane \(\PP^2\).  In turn, we can
consider the field of rational functions \(k(C)\) on this conic; it is
the field of fractions of the algebra \(k[x,y]/\langle ax^2 + by^2 -
1\rangle.\) One sometimes calls \(k(C)\) the ``function field of \(C\)''.

We may now state an important theorem due to Witt:
\begin{theorem}
Let \(Q_1 = (a_1,b_1)_k\) and \(Q_2 = (a_2,b_2)_k\) be quaternion
algebras over \(k\), and let \(C_1\) and \(C_2\) be the associated
conics. The algebra \(Q_1\) and \(Q_2\) are isomorphic if and only if
the the function fields \(k(C_1)\) and \(k(C_2)\) are isomorphic.
\label{theorem:witt}
\end{theorem}

In particular, Witt's theorem shows that two quaternion algebras are
isomorphic if and only if the associated conics are isomorphic as
algebraic curves.
\end{document}
